# datatype conversion

In [2]:
 import pandas as pd

In [3]:
import warnings
warnings.filterwarnings("ignore")

In [5]:
df=pd.DataFrame({
    "Age":["23","25","21"],
    "Salary":[1000.5,2000.0,1500.75],
    "Employed":[1,0,1]
})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       3 non-null      object
 1   Salary    3 non-null      float64
 2   Employed  3 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       3 non-null      object
 1   Salary    3 non-null      float64
 2   Employed  3 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes

In [10]:
#convert age from object to int
df["Age"]=df["Age"].astype(int)
df.dtypes

Age           int64
Salary      float64
Employed      int64
dtype: object

In [11]:
df["Salary"]=df["Salary"].astype(int)
df.dtypes

Age         int64
Salary      int64
Employed    int64
dtype: object

In [13]:
df["Employed"]=df["Employed"].astype(int)
df.dtypes

Age         int64
Salary      int64
Employed    int64
dtype: object

## pd.to_numeric

In [16]:
df["Salary"]=df["Salary"].astype(str)
print(df.dtypes)
print("---"*15)
df["Age"]=pd.to_numeric(df["Age"],errors="coerce")
print(df.dtypes)

Age          int64
Salary      object
Employed     int64
dtype: object
---------------------------------------------
Age          int64
Salary      object
Employed     int64
dtype: object

## pd.to_datetime

In [17]:
df["JoinDate"]=pd.to_datetime(["2025-09-09","2024-01-01","2023-12-15"])
df.dtypes

Age                  int64
Salary              object
Employed             int64
JoinDate    datetime64[ns]
dtype: object

## pd.to_timedelta()

In [19]:
df["Experience"]=pd.to_timedelta(["365 days","730 days","1095 days"])
df.dtypes

Age                     int64
Salary                 object
Employed                int64
JoinDate       datetime64[ns]
Experience    timedelta64[ns]
dtype: object

## pd.series()

In [22]:
df["Department"]=pd.Series(["HR","IT","Finance"]).astype("category")
df.dtypes

Age                     int64
Salary                 object
Employed                int64
JoinDate       datetime64[ns]
Experience    timedelta64[ns]
Department           category
dtype: object

## getting row/label

In [27]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Marks":[85,90,78]
},index=[101,102,103])
df

    Name  Marks
101    A     85
102    B     90
103    C     78

In [28]:
print(df.index)
print(df.index.tolist())

Index([101, 102, 103], dtype='int64')
[101, 102, 103]

In [30]:
print(df.reset_index()) # kepps old index as column
print(df.reset_index(drop=True))# removes old index

   index Name  Marks
0    101    A     85
1    102    B     90
2    103    C     78
  Name  Marks
0    A     85
1    B     90
2    C     78

In [33]:
df2=pd.DataFrame({
    "Rool no":[101,102,103],
    "Name":["A","B","C"],
    "Marks":[85,90,78]
})
df2

   Rool no Name  Marks
0      101    A     85
1      102    B     90
2      103    C     78

In [35]:
print(df2.set_index("Rool no"))

        Name  Marks
Rool no
101        A     85
102        B     90
103        C     78

In [37]:
df2.loc[2]

Rool no    103
Name         C
Marks       78
Name: 2, dtype: object

In [39]:
df2.iloc[2]

Rool no    103
Name         C
Marks       78
Name: 2, dtype: object

In [40]:
df3=pd.DataFrame({
    "Name":["A","B","C"],
    "Marks":[85,90,78]
},index=[101,102,103])
df3

    Name  Marks
101    A     85
102    B     90
103    C     78

In [43]:
# rename
df_renamed=df3.rename(index={101:201,103:203})
df_renamed

    Name  Marks
201    A     85
102    B     90
203    C     78

## Adding rows and droping rows

In [44]:
df4=pd.DataFrame({
    "Name":["A","B","C"],
    "Marks":[85,90,78]
},index=[101,102,103])
df4

    Name  Marks
101    A     85
102    B     90
103    C     78

In [45]:
df4.loc[104]=["D",85]
df4

    Name  Marks
101    A     85
102    B     90
103    C     78
104    D     85

In [51]:
df4.loc[105]=["E",86]
df4

    Name  Marks
101    A     85
102    B     90
103    E     86
104    D     85
105    E     86

### using concat

In [50]:
#to add  new row at the end of df,use locor concat()
new_row=pd.DataFrame({"Name":["E"],"Marks":[95]},index=[105])
df2=pd.concat([df,new_row])
df2

     Rool no Name  Marks
0      101.0    A     85
1      102.0    B     90
2      103.0    C     78
105      NaN    E     95

In [55]:
df=pd.DataFrame({
    "Name":["A","B","C"],
    "Marks":[85,90,78]
},index=[101,102,103])
df

    Name  Marks
101    A     85
102    B     90
103    C     78

In [60]:
# add the  new row at the middle of df
new_row=pd.DataFrame({"Name":["D"],"Marks":[95]},index=[100])
df=pd.concat([df,new_row])
df=df.sort_index().reset_index(drop=True)
df

  Name  Marks
0    A     85
1    B     90
2    D     95
3    C     78
4    D     95
5    D     95
6    D     95
7    D     95

## droping rows

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame({
    "Name":["A","B","C","D","E"],
    "Marks":[85,90,78,90,92]
},index=[101,102,103,104,105])
df

    Name  Marks
101    A     85
102    B     90
103    C     78
104    D     90
105    E     92

In [6]:
df1=df.drop(102)
df1

    Name  Marks
101    A     85
103    C     78
104    D     90
105    E     92

In [16]:
df.drop([101,105],inplace=True)

df

    Name  Marks
103    C     78